tutorials/forwardStep/Allrun
mpirun --oversubscribe -np 12 twoPhaseMixingHLLCFoam -parallel | tee log.HLLC
