tutorials/forwardStep/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          160;
        startFace       128384;
    }
    outlet
    {
        type            patch;
        nFaces          128;
        startFace       128544;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          96;
        startFace       128672;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          480;
        startFace       128768;
    }
    obstacle
    {
        type            wall;
        inGroups        1(wall);
        nFaces          416;
        startFace       129248;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          129024;
        startFace       129664;
    }
)

// ************************************************************************* //
