tutorials/forwardStep/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     twoPhaseMixingHLLCFoam;

startFrom       latestTime;//startTime;

startTime       0;

stopAt          endTime;

deltaT          1e-5;

writeControl    adjustableRunTime;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;//on;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  true;

maxCo           0.25;

CourantType     cellCourant;

#include "control.local"
//functions
//{
//    #include "conservativityControlDict"
//}


// ************************************************************************* //
